helloMsg = ("Приветствую тебя {0} ✋, я - {1} бот.\n"
            "Сегодня я постараюсь тебе помочь.\n"
            "Моя главная задача помочь тебе улучшить твои финансы.\n"
            "Ты можешь рассказать мне о своих доходах и расходах,\n"
            "а я непременно их запомню и как только ты захочешь,\n"
            "я напомню тебе о них. Но это еще не все...\n"
            "Если нашел ошибку нажми кнопку «Сообщить об ошибке.✉️»")

authorMsg = ("Проект был выполнен в ходе проектной работы,\n"
            "учеником МБОУ СОШ №32 г.Астрахань\n"
            "Наследсковым Михаилом, 10М класс.\n"
            "Март 2022.")

commandsMsg = ("Чтобы увеличить сумму доходов воспользуйтесь командой:\n"
                "/addIncome <Сумма>"
                "\n"
                "\n"
                "Чтобы увеличить сумму доходов воспользуйтесь командой:\n"
                "/addConsumption <Сумма>"
                "\n"
                "\n"
                "Чтобы устоновить цель,на которую вы хотите копить,\n"
                "воспользуйтесь командой: \n "
                "/setTarget <Сумма которой вы хотите достичь>"
                "\n"
                "\n"
                "Чтобы изменить ежемесячный заработок воспользуйтесь\n"
                "следующей командой:\n"
                "/addMonthIncome <Сумма>"
                "\n"
                "\n"
                "Чтобы изменить ежемесячные траты воспользуйтесь\n"
                "следующей командой:\n"
                "/addMonthConsumption <Сумма>")

successaddmoneyMsg = "В копилку успешно добавлено: {}💵"
successputawaymoneyMsg = "Вы забрали {} из копилки"
successaddmonthmoneyMsg = "Вы изменил свой ежемесечный заработок на: \n{}💵"
successputawaymonthmoneyMsg = "Вы изменил свои ежемесечные расходы на: \n{}💵"
successdeleteuserdataMsg = "Введенные вами данные успешно удалены"

errbudgetMsg = "Ваш бюджет дефицитный вам не достичь цели.😕"
errdeleteuserdataMsg = ("Похоже вы еще не пользовались функциями бота,\n"
                        "ваши данные отсутствуют.🙃")

finderrorMsg = ("Похоже вы нашли ошибку в программе.\n"
                "Оставьте заявку с описанием проблемы по \n"
                "следующей ссылке:\n"
                "https://forms.gle/1smk58dyYQTL7whp6"
                "\n"
                "Ваша заявка обязательно будет расмотрена и проблема решена соответственно.")

moneyboxMsg = "Удачного использоваия Копилки!"

deltamoneyPosMsg = ("Ваш бюджет профицитный и равен: {}💵.\n"
                "Так держать у вас все хорошо😌.") 
deltamoneyNegMsg = ("Ваш бюджет дефицитный и равен: {}💵.\n"
                "Стоит уменьшить расходы или увеличить доходы😕.")

deltamonthmoneyPosMsg = ("Ваш ежемесячный бюджет профицитный и равен: {}💵.\n"
                "Так держать у вас все хорошо😌.") 
deltamonthmoneyNegMsg = ("Ваш ежемесячный бюджет дефицитный и равен: {}💵.\n"
                "Стоит уменьшить расходы или увеличить доходы😕")

gettargettimeMsg = ("Чтобы накопить поставленную сумму ({0}💵)\n"
                    "вам нужно подождать всего {1}📆")

successsetTarget = "Вы успешно устоновили цель достичь {}💵"

undefindMoney = 'Похоже вы еще не вводили колличество сбережений.'
undefindmonthMoney = 'Похоже вы еще не вводили колличество ежемесечных сбережений.'
undefindTarget = ("Вы еще не установили цель чтобы это исправить \n"
                "нажимите на кнопку «Команды⚙️» и следуйте инструкциям")

undefindText = 'Я вас не понимаю, проверьте может быть вы допустили ошибку.'


moneyboxBtn = "Перейти к копилке 💰"
getdeltaBtn = "Узнать текущий бюджет 💴"
getmonthdeltaBtn = "Узнать ежемесечный бюджет 💶"
deletedataBtn = "Удалить все данные 🗑"
gettargettimeBtn = "До цели осталось...💎"
backBtn = "Назад ◀️"
commandsBtn = "Команды ⚙️"
errorBtn = "Сообщить об ошибке ✉️"
authorBtn = "Автор 👱‍♂️"



connectionError = "Произошла ошибка соеденения: <{}>"
undefindError = "Произошла непредвиденная ошибка: <{}>"